{
  "dialogues": {
    "manny": {
      "start": {
        "text": [
          "¡Oh! ¡Un alma viviente! No te asustes, soy Manny,",
          "el arquitecto fantasma de esta maravilla inacabada."
        ],
        "responses": [
          {
            "text": "¿Fantasma? ¿Qué te pasó?",
            "next": "mannyDeath1"
          },
          {
            "text": "¿Trabajabas aquí?",
            "next": "mannyJob"
          },
          {
            "textHiddenID": "askForKeys",
            "text": "¿Puedo tomar las llaves del suelo?",
            "next": "canTakeKeys"
          }
        ]
      },
      "mannyDeath1": {
        "text": [
          "Ah, bueno, digamos que no llegué a terminar mi jornada laboral...",
          "Unos matones me sacaron del coche y me llevaron a un almacén oscuro.",
          "Me obligaron a terminar la Sagrada Familia...",
          "pero claro, no soy de los que trabajan bajo presión."
        ],
        "responses": [
          {
            "text": "¿Qué querían de ti?",
            "next": "mannyDeath2"
          }
        ]
      },
      "mannyDeath2": {
        "text": [
          "Me querían obligar a acabarla.",
          "¿Te imaginas? ¡Yo, Manny, terminando la obra de mi vida bajo amenazas!",
          "Les dije que no lo haría. Y ahí fue donde las cosas se pusieron feas."
        ],
        "responses": [
          {
            "text": "¿Cómo terminó todo?",
            "next": "mannyDeath3"
          },
          {
            "text": "¿Intentaste resistirte?",
            "next": "mannyFight"
          }
        ]
      },
      "mannyFight": {
        "text": [
          "¡Claro que sí! Pero, ¿alguna vez has intentado pelear",
          "contra tres tipos con planos en las manos?",
          "No es lo ideal, y bueno, digamos que acabé siendo parte del mobiliario de Barcelona."
        ],
        "responses": [
          {
            "text": "Eso suena terrible... ¿y qué pasó luego?",
            "next": "mannyDeath3"
          }
        ]
      },
      "mannyDeath3": {
        "text": [
          "Ya ves, me asesinaron y ahora soy un fantasma.",
          "Al menos tengo una buena vista de la Sagrada Familia desde aquí.",
          "Podría haber sido peor... ¡aunque esto de ser fantasma es un trabajo eterno!"
        ],
        "responses": [
          {
            "text": "¿Te molesta estar aquí?",
            "next": "mannyReflect"
          },
          {
            "text": "¿Por qué no quisiste terminar la obra?",
            "next": "mannyPride"
          }
        ]
      },
      "mannyReflect": {
        "text": [
          "Molestar no es la palabra... ¡es aburrido! Siempre los mismos turistas y guías...",
          "A veces me pregunto si algún día podré descansar,",
          "pero al menos tengo la eternidad para admirar mi obra."
        ],
        "responses": [
          {
            "text": "Entonces, ¿todo fue por orgullo?",
            "next": "mannyPride"
          }
        ]
      },
      "mannyPride": {
        "text": [
          "No iba a terminar una obra tan grandiosa bajo amenazas.",
          "La Sagrada Familia merece lo mejor, y trabajar con esos matones no era el camino.",
          "Preferí morir antes que hacerlo a las prisas."
        ],
        "responses": [
          {
            "text": "¿Qué piensas del progreso actual en la obra?",
            "next": "mannyOpinion"
          }
        ]
      },
      "mannyOpinion": {
        "text": [
          "Bueno, han hecho un buen trabajo, pero no es lo que yo habría hecho.",
          "¿Torres más grandes? ¡Por supuesto! ¿Un tobogán gigante? ¡Quizás!",
          "Pero nadie me ha pedido mi opinión desde... ya sabes, lo del almacén."
        ],
        "responses": []
      },
      "mannyJob": {
        "text": [
          "¡Claro que sí! Era el encargado de finalizar la obra.",
          "Pero, bueno, no pude poner ni un ladrillo más después de lo del almacén...",
          "¡Una lástima! La obra estaba casi en su punto más emocionante."
        ],
        "responses": [
          {
            "text": "¿Cómo fue trabajar aquí antes de eso?",
            "next": "mannyWorkExperience"
          }
        ]
      },
      "mannyWorkExperience": {
        "text": [
          "Era increíble, cada día era un nuevo reto. Gaudí dejó planos espectaculares.",
          "Era como armar un rompecabezas gigante, pero sin usar ángulos rectos.",
          "¡Gaudí odiaba los ángulos rectos!"
        ],
        "responses": [
          {
            "text": "¿Por qué odiaba los ángulos rectos?",
            "next": "gaudiExplanation"
          }
        ]
      },
      "gaudiExplanation": {
        "text": [
          "Decía que los ángulos rectos no existían en la naturaleza.",
          "Por eso la Sagrada Familia parece una cueva creada por dioses.",
          "Aunque... yo creo que también se cansó de usar la escuadra."
        ],
        "responses": []
      },
      "canTakeKeys": {
        "text": [
          "¿Las llaves de mi coche? Oh, claro, las dejé",
          "tiradas cuando esos matones me sacaron de él...",
          "Pero... no sé si debería dejártelas,",
          "¡ese coche es lo último que me queda de mi vida pasada!"
        ],
        "responses": [
          {
            "text": "Vamos, no creo que las necesites ya...",
            "next": "notConvinced"
          },
          {
            "text": "Te prometo que las cuidaré bien, además, quizás puedas finalmente descansar.",
            "next": "convinced"
          }
        ]
      },
      "notConvinced": {
        "text": [
          "Hmm... no estoy tan seguro. No sé si estoy listo para dejarlo ir todavía.",
          "Me trae demasiados recuerdos, lo siento, amigo."
        ],
        "responses": []
      },
      "convinced": {
        "text": [
          "...",
          "Bueno, tienes razón...",
          "Quizás ya es hora de seguir adelante...",
          "Tómalo, cuídalo bien. ¡Espero que te sea más útil a ti que a mí!",
          "Ahora... me parece que es momento de desaparecer. ¡Adiós!"
        ],
        "responses": []
      }
    }
  }
}
